requisições/req_2026-01-06T23-12-31-119Z_ExecuteWithXmlParams.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:ExecuteWithXmlParams>
         <tot:ProcessServerName>FinBorderoAutzDataProc</tot:ProcessServerName>
         <tot:strXmlParams><![CDATA[<FinBorderoAutzParamsProc z:Id="i1" xmlns="http://www.totvs.com.br/RM/" xmlns:i="http://www.w3.org/2001/XMLSchema-instance" xmlns:z="http://schemas.microsoft.com/2003/10/Serialization/">
  <ActionModule xmlns="http://www.totvs.com/">F</ActionModule>
  <ActionName xmlns="http://www.totvs.com/">FinBorderoAutzActionProc</ActionName>
  <CanParallelize xmlns="http://www.totvs.com/">true</CanParallelize>
  <CanSendMail xmlns="http://www.totvs.com/">false</CanSendMail>
  <CanWaitSchedule xmlns="http://www.totvs.com/">false</CanWaitSchedule>
  <CodUsuario xmlns="http://www.totvs.com/">mestre</CodUsuario>
  <ConnectionId i:nil="true" xmlns="http://www.totvs.com/" />
  <ConnectionString i:nil="true" xmlns="http://www.totvs.com/" />
  <Context z:Id="i2" xmlns="http://www.totvs.com/" xmlns:a="http://www.totvs.com.br/RM/">
    <a:_params xmlns:b="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$EXERCICIOFISCAL</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">22</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODLOCPRT</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">-1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODTIPOCURSO</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$EDUTIPOUSR</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">-1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODUNIDADEBIB</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODCOLIGADA</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$RHTIPOUSR</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">-1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODIGOEXTERNO</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">-1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODSISTEMA</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">F</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODUSUARIOSERVICO</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema" />
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODUSUARIO</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">mestre</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$IDPRJ</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">2</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CHAPAFUNCIONARIO</b:Key>
        <b:Value i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">-1</b:Value>
      </b:KeyValueOfanyTypeanyType>
      <b:KeyValueOfanyTypeanyType>
        <b:Key i:type="c:string" xmlns:c="http://www.w3.org/2001/XMLSchema">$CODFILIAL</b:Key>
        <b:Value i:type="c:int" xmlns:c="http://www.w3.org/2001/XMLSchema">1</b:Value>
      </b:KeyValueOfanyTypeanyType>
    </a:_params>
    <a:Environment>DotNet</a:Environment>
  </Context>
  <CustomData i:nil="true" xmlns="http://www.totvs.com/" />
  <DisableIsolateProcess xmlns="http://www.totvs.com/">false</DisableIsolateProcess>
  <DriverType i:nil="true" xmlns="http://www.totvs.com/" />
  <ExecutionId xmlns="http://www.totvs.com/">fae4cea2-8dad-4491-b2fa-53dceb40bf89</ExecutionId>
  <FailureMessage xmlns="http://www.totvs.com/">Falha na execução do processo</FailureMessage>
  <FriendlyLogs i:nil="true" xmlns="http://www.totvs.com/" />
  <HideProgressDialog xmlns="http://www.totvs.com/">false</HideProgressDialog>
  <HostName xmlns="http://www.totvs.com/">PortalRM-Client</HostName>
  <Initialized xmlns="http://www.totvs.com/">true</Initialized>
  <Ip xmlns="http://www.totvs.com/">127.0.0.1</Ip>
  <IsolateProcess xmlns="http://www.totvs.com/">false</IsolateProcess>
  <JobID xmlns="http://www.totvs.com/">
    <Children />
    <ExecID>1</ExecID>
    <ID>1</ID>
    <IsPriorityJob>false</IsPriorityJob>
  </JobID>
  <JobServerHostName xmlns="http://www.totvs.com/">SERVER</JobServerHostName>
  <MasterActionName xmlns="http://www.totvs.com/">FinBorderoAction</MasterActionName>
  <MaximumQuantityOfPrimaryKeysPerProcess xmlns="http://www.totvs.com/">1000</MaximumQuantityOfPrimaryKeysPerProcess>
  <MinimumQuantityOfPrimaryKeysPerProcess xmlns="http://www.totvs.com/">1</MinimumQuantityOfPrimaryKeysPerProcess>
  <NetworkUser xmlns="http://www.totvs.com/">mestre</NetworkUser>
  <NotifyEmail xmlns="http://www.totvs.com/">false</NotifyEmail>
  <NotifyEmailList i:nil="true" xmlns="http://www.totvs.com/" xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays" />
  <NotifyFluig xmlns="http://www.totvs.com/">false</NotifyFluig>
  <OnlineMode xmlns="http://www.totvs.com/">false</OnlineMode>
  <PrimaryKeyList xmlns="http://www.totvs.com/" xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
    <a:ArrayOfanyType>
      <a:anyType i:type="b:short" xmlns:b="http://www.w3.org/2001/XMLSchema">1</a:anyType>
      <a:anyType i:type="b:short" xmlns:b="http://www.w3.org/2001/XMLSchema">1</a:anyType>
      <a:anyType i:type="b:string" xmlns:b="http://www.w3.org/2001/XMLSchema">MEUERP01</a:anyType>
      <a:anyType i:type="b:int" xmlns:b="http://www.w3.org/2001/XMLSchema">1</a:anyType>
    </a:ArrayOfanyType>
  </PrimaryKeyList>
  <PrimaryKeyNames xmlns="http://www.totvs.com/" xmlns:a="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
    <a:string>CODCOLIGADA</a:string>
    <a:string>CODCOLCXA</a:string>
    <a:string>CODCXA</a:string>
    <a:string>IDBORDERO</a:string>
  </PrimaryKeyNames>
  <PrimaryKeyTableName xmlns="http://www.totvs.com/">FBORDERO</PrimaryKeyTableName>
  <ProcessName xmlns="http://www.totvs.com/">Autorização de Borderô de Pagamentos</ProcessName>
  <QuantityOfSplits xmlns="http://www.totvs.com/">0</QuantityOfSplits>
  <SaveLogInDatabase xmlns="http://www.totvs.com/">true</SaveLogInDatabase>
  <SaveParamsExecution xmlns="http://www.totvs.com/">false</SaveParamsExecution>
  <ScheduleDateTime xmlns="http://www.totvs.com/">2026-01-06T20:12:31.0000000-03:00</ScheduleDateTime>
  <Scheduler xmlns="http://www.totvs.com/">JobMonitor</Scheduler>
  <SendMail xmlns="http://www.totvs.com/">false</SendMail>
  <ServerName xmlns="http://www.totvs.com/">FinBorderoAutzDataProc</ServerName>
  <ServiceInterface i:nil="true" xmlns="http://www.totvs.com/" xmlns:a="http://schemas.datacontract.org/2004/07/System" />
  <ShouldParallelize xmlns="http://www.totvs.com/">false</ShouldParallelize>
  <ShowReExecuteButton xmlns="http://www.totvs.com/">true</ShowReExecuteButton>
  <StatusMessage i:nil="true" xmlns="http://www.totvs.com/" />
  <SuccessMessage xmlns="http://www.totvs.com/">Processo executado com sucesso</SuccessMessage>
  <SyncExecution xmlns="http://www.totvs.com/">true</SyncExecution>
  <UseJobMonitor xmlns="http://www.totvs.com/">false</UseJobMonitor>
  <UserName xmlns="http://www.totvs.com/">mestre</UserName>
  <WaitSchedule xmlns="http://www.totvs.com/">false</WaitSchedule>
  <AtutorizaBoderoRemetido>false</AtutorizaBoderoRemetido>
  <Autoriza>true</Autoriza>
  <CodColigada>1</CodColigada>
  <CodUsuarioAutz>mestre</CodUsuarioAutz>
  <DataSistema>2026-01-06T00:00:00-03:00</DataSistema>
  <DataValidade>2026-01-06T00:00:00-03:00</DataValidade>
</FinBorderoAutzParamsProc>]]></tot:strXmlParams>
      </tot:ExecuteWithXmlParams>
   </soapenv:Body>
</soapenv:Envelope>